### layla

In [2]:
word = 'Layla'
sent = 'Layla is Cute'

In [3]:
word[0]

'L'

In [4]:
sent[0]

'L'

In [5]:
sent[0:5]

'Layla'

In [6]:
text = 'The layla is cute because she was cute'

In [7]:
text[:len(text)]

'The layla is cute because she was cute'

In [8]:
text[:]

'The layla is cute because she was cute'

In [9]:
text[0:len(text)]

'The layla is cute because she was cute'

In [10]:
'output = {0:4.6}'.format(7/67890)

'output = 0.000103108'

In [11]:
sent[-3:]

'ute'

In [14]:
sent[-4:-1]

'Cut'

In [15]:
word[:3]

'Lay'

In [16]:
word[0:3]

'Lay'

In [17]:
sent[4:]

'a is Cute'

In [18]:
sent[:]

'Layla is Cute'

In [19]:
sent[::2]

'Lyai ue'

In [20]:
a = 'Name : Layla'
b = 'StudentID : 20231111'
c = 'Hobby : Study'
d = 'Comment : cute'

In [21]:
" ".join([a, b, c, d])

'Name : Layla StudentID : 20231111 Hobby : Study Comment : cute'

In [24]:
" ".join([a, b, c, d])

'Name : Layla StudentID : 20231111 Hobby : Study Comment : cute'

In [25]:
strs = """Guard: What? Ridden en a horse?
Queen Raiden: Yes!
Guard: You're using cocnuts!
Queen Raiden: What?
Guard: You've Got ... coconutes[s] and you're banagin em toghter"""

In [27]:
strs.splitlines()[::2]

['Guard: What? Ridden en a horse?',
 "Guard: You're using cocnuts!",
 "Guard: You've Got ... coconutes[s] and you're banagin em toghter"]

In [29]:
strs.replace('Guard', 'Yae Miko').splitlines()[::2]

['Yae Miko: What? Ridden en a horse?',
 "Yae Miko: You're using cocnuts!",
 "Yae Miko: You've Got ... coconutes[s] and you're banagin em toghter"]

In [30]:
'{} is very cute!'.format('Layla')

'Layla is very cute!'

In [31]:
"""{0}은 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 {1}은 {0}을 괴롭히는 원인 중 하나입니다.""".format('레일라','나히다')

'레일라은 매우매우 착하고 귀엽고 사랑스럽습니다.\n이 사악한 나히다은 레일라을 괴롭히는 원인 중 하나입니다.'

In [32]:
'나히다는 {age} 살 이상이다.'.format(age = 500)

'나히다는 500 살 이상이다.'

In [35]:
'루미네는 {action} 이고, 레일라는 {model}이다.'.format(action = "귀엽고",model = '귀엽고 사랑스럽다')

'루미네는 귀엽고 이고, 레일라는 귀엽고 사랑스럽다이다.'

In [36]:
'내 통장 잔고가 {:,} 원이면 좋겠다'.format(999999999999999999999999999999999999999)

'내 통장 잔고가 999,999,999,999,999,999,999,999,999,999,999,999,999 원이면 좋겠다'

In [38]:
'first out : {0:.3}, second out : {0:.3%}'.format(7/67890)

'first out : 0.000103, second out : 0.010%'

In [39]:
'My id code is {0:06d}'.format(12)

'My id code is 000012'

In [40]:
'My love number is %d' % 10

'My love number is 10'

In [41]:
'%(name)s 는 귀엽고 사랑스럽습니다. 그러나 그녀의 수면 시간은 고작 %(time).2f 입니다.' % ({'name':'레일라','time':1.1631212})

'레일라 는 귀엽고 사랑스럽습니다. 그러나 그녀의 수면 시간은 고작 1.16 입니다.'

In [42]:
name = '레일라'
month = 12
day = 19

In [43]:
print(f"{month}/{day}! 생일 축하해 레일라!")

12/19! 생일 축하해 레일라!

In [44]:
import datetime

In [46]:
print("t1 : " + str(datetime.datetime.now()))

t1 : 2023-12-16 18:30:28.543469

In [48]:
print("t1 : " + str(datetime.datetime.now()))
print("t2 : " + str(datetime.datetime(1970, 1, 1)))
print("t3 : " + str(datetime.datetime(1970, 12, 12, 13, 24, 34)))

t1 : 2023-12-16 18:31:22.279883
t2 : 1970-01-01 00:00:00
t3 : 1970-12-12 13:24:34

In [49]:
import re

In [51]:
ax = re.match(pattern='\d{10}', string = '1234567890')
ax

In [52]:
"match" if bool(ax) else "Un matched"

'match'

In [53]:
ax.start()

0

In [58]:
ax.group()[ax.start()]

'1'

In [59]:
ax.end()

10

In [60]:
ax.group()[ax.end() - 1]

'0'

In [61]:
ax.span()

(0, 10)

In [62]:
ax.group()

'1234567890'

In [63]:
re.match(pattern='\d{3}\s\d{4}\s\d{4}', string = '123 4567 8901')

In [64]:
re.match(pattern='\(\d{3}\)\s\d{3}\-\d{4}', string = '(123) 456-7890')

In [65]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string ='+1 (123) 456-7890')

In [66]:
number = ['123 456 7890', '(123) 456-7890', '+1 (123) 456-7890']

In [78]:
for i in number:
    ax = re.match(pattern='(\+\d{1,3}\s)?(\()?\d{3}(\))?\s\d{3}[-.\s]\d{4}', string = str(i))
    print(i if bool(ax) else "unmatch")

123 456 7890
(123) 456-7890
+1 (123) 456-7890

In [79]:
p = re.compile('\D{9}\:\d{4}')

In [80]:
p.match('localhost:8888')

In [81]:
my_exp = lambda x : x ** 2

In [82]:
my_exp_c = lambda x, n : x ** n

In [84]:
import pandas as pd

In [85]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [86]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [87]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [88]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [89]:
df['a'] ** 10

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [90]:
df['a'].apply(my_exp_c, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [91]:
printme = lambda x : print(x)

In [92]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [93]:
# 행렬 반전 (axis0 => axis1 , axis1 => axis0)

In [94]:
df.apply(printme, axis = 1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [95]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [96]:
def getmean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [97]:
df.apply(getmean)

a    20.0
b    30.0
dtype: float64

In [98]:
import numpy as np

In [99]:
df.apply(np.mean)

a    20.0
b    30.0
dtype: float64

In [100]:
df.apply(getmean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [101]:
df.apply(np.mean, axis =1 )

0    15.0
1    25.0
2    35.0
dtype: float64

In [102]:
import seaborn as sns

In [103]:
df = sns.load_dataset("titanic")

In [104]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [105]:
df['missing'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [106]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [109]:
df.apply(lambda x : pd.isnull(x).sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
missing          0
dtype: int64

In [110]:
def getnan(x):
    return pd.isnull(x).sum()

In [111]:
df.apply(getnan)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
missing          0
dtype: int64

In [112]:
def getp(x):
    return pd.isnull(x).sum() / len(x)

In [113]:
getp2 = lambda x : pd.isnull(x).sum() / len(x)

In [114]:
df.apply(getp)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
missing        0.000000
dtype: float64

In [116]:
a = df.apply(getp2)
a

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
missing        0.000000
dtype: float64

In [117]:
percenter = lambda x : (pd.isnull(x).sum() / len(x)) * 100

In [119]:
a = df.apply(percenter)
a

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
missing         0.000000
dtype: float64

In [120]:
nonnan = lambda x : 1 - (pd.isnull(x).sum() / len(x))

In [121]:
df.apply(nonnan)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
missing        1.000000
dtype: float64

In [122]:
nonnan2 = lambda x : (1 - (pd.isnull(x).sum() / len(x))) * 100

In [124]:
b = df.apply(nonnan2)
b

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
missing        100.000000
dtype: float64

In [125]:
a

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
missing         0.000000
dtype: float64

In [126]:
b

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
missing        100.000000
dtype: float64

In [127]:
a + b

survived       100.0
pclass         100.0
sex            100.0
age            100.0
sibsp          100.0
parch          100.0
fare           100.0
embarked       100.0
class          100.0
who            100.0
adult_male     100.0
deck           100.0
embark_town    100.0
alive          100.0
alone          100.0
missing        100.0
dtype: float64

In [128]:
df[df['missing'] >= 2].sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
358,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2
511,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
87,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
45,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
181,0,2,male,NaN,0,0,15.0500,C,Second,man,True,NaN,Cherbourg,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
692,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True,2
367,1,3,female,NaN,0,0,7.2292,C,Third,woman,False,NaN,Cherbourg,yes,True,2
602,0,1,male,NaN,0,0,42.4000,S,First,man,True,NaN,Southampton,no,True,2
557,0,1,male,NaN,0,0,227.5250,C,First,man,True,NaN,Cherbourg,no,True,2
364,0,3,male,NaN,1,0,15.5000,Q,Third,man,True,NaN,Queenstown,no,False,2

In [129]:
df[df['missing'] >= 2].sample(100)['missing'].value_counts()

2    100
Name: missing, dtype: int64

In [130]:
df['missing'].value_counts()

1    549
0    182
2    160
Name: missing, dtype: int64

In [131]:
df = pd.read_csv('../data/gapminder.tsv', sep = '\t')

In [132]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [133]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [134]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [135]:
print(df['year'].unique())

[1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 2002 2007]

In [136]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [138]:
y1952 = df[df['year'] == 1952]['lifeExp'].mean()
y1957 = df[df['year'] == 1957]['lifeExp'].mean()
y1962 = df[df['year'] == 1962]['lifeExp'].mean()
y2007 = df[df['year'] == 2007]['lifeExp'].mean()

In [139]:
df= pd.DataFrame({
    'year' : [1952, 1957, 1962, 2007],
    "" : [y1952, y1957, y1962, y2007]
})

In [140]:
df

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [141]:
def get_mean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [145]:
df.groupby('year')['lifeExp'].apply(get_mean)

KeyError: 'Column not found: lifeExp'

In [146]:
df

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [149]:
df = pd.read_csv('../data/gapminder.tsv', sep ='\t')

In [150]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [151]:
df.groupby('year').lifeExp.apply(get_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [152]:
df.groupby('year').lifeExp.apply(np.mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [153]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [154]:
def diff_get_mean(x, n):
    sum = 0
    for i in x:
        sum += i
    return (sum / len(x)) - n

In [155]:
df.groupby('year')['lifeExp'].apply(diff_get_mean, n = df['lifeExp'].mean())

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [157]:
df.groupby('year')['lifeExp'].agg([np.count_nonzero, np.mean, np.std])

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

In [159]:
df.groupby('year').agg({'lifeExp':'mean', 'pop':'median', 'gdpPercap':'median'})

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [160]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [161]:
z_score = lambda x : (x - x.mean()) / x.std()

In [162]:
df.groupby('year').lifeExp.transform(z_score)

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [163]:
df.groupby('year').lifeExp.apply(z_score)

C:\Users\starl\AppData\Local\Temp\ipykernel_2152\1577534287.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df.groupby('year').lifeExp.apply(z_score)

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [164]:
df10 = sns.load_dataset("tips").sample(10)

In [165]:
df10

     total_bill   tip     sex smoker   day    time  size
68        20.23  2.01    Male     No   Sat  Dinner     2
213       13.27  2.50  Female    Yes   Sat  Dinner     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
173       31.85  3.18    Male    Yes   Sun  Dinner     2
50        12.54  2.50    Male     No   Sun  Dinner     2
137       14.15  2.00  Female     No  Thur   Lunch     2
30         9.55  1.45    Male     No   Sat  Dinner     2
139       13.16  2.75  Female     No  Thur   Lunch     2
219       30.14  3.09  Female    Yes   Sat  Dinner     4
80        19.44  3.00    Male    Yes  Thur   Lunch     2

In [166]:
df = df10

In [167]:
df

     total_bill   tip     sex smoker   day    time  size
68        20.23  2.01    Male     No   Sat  Dinner     2
213       13.27  2.50  Female    Yes   Sat  Dinner     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
173       31.85  3.18    Male    Yes   Sun  Dinner     2
50        12.54  2.50    Male     No   Sun  Dinner     2
137       14.15  2.00  Female     No  Thur   Lunch     2
30         9.55  1.45    Male     No   Sat  Dinner     2
139       13.16  2.75  Female     No  Thur   Lunch     2
219       30.14  3.09  Female    Yes   Sat  Dinner     4
80        19.44  3.00    Male    Yes  Thur   Lunch     2

In [168]:
df.loc[np.random.permutation(df.index)[:4], 'total_bill'] = np.NAN

In [169]:
df

     total_bill   tip     sex smoker   day    time  size
68          NaN  2.01    Male     No   Sat  Dinner     2
213       13.27  2.50  Female    Yes   Sat  Dinner     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
173         NaN  3.18    Male    Yes   Sun  Dinner     2
50          NaN  2.50    Male     No   Sun  Dinner     2
137       14.15  2.00  Female     No  Thur   Lunch     2
30         9.55  1.45    Male     No   Sat  Dinner     2
139       13.16  2.75  Female     No  Thur   Lunch     2
219       30.14  3.09  Female    Yes   Sat  Dinner     4
80          NaN  3.00    Male    Yes  Thur   Lunch     2

In [170]:
df.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             1    5       5    5     5     5
Female           5    5       5    5     5     5

In [171]:
df['mean of sex'] = df.groupby('sex').total_bill.apply(lambda x : x.fillna(x.mean()))

C:\Users\starl\AppData\Local\Temp\ipykernel_2152\732128801.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df['mean of sex'] = df.groupby('sex').total_bill.apply(lambda x : x.fillna(x.mean()))

In [172]:
df

     total_bill   tip     sex smoker   day    time  size  mean of sex
68          NaN  2.01    Male     No   Sat  Dinner     2         9.55
213       13.27  2.50  Female    Yes   Sat  Dinner     2        13.27
229       22.12  2.88  Female    Yes   Sat  Dinner     2        22.12
173         NaN  3.18    Male    Yes   Sun  Dinner     2         9.55
50          NaN  2.50    Male     No   Sun  Dinner     2         9.55
137       14.15  2.00  Female     No  Thur   Lunch     2        14.15
30         9.55  1.45    Male     No   Sat  Dinner     2         9.55
139       13.16  2.75  Female     No  Thur   Lunch     2        13.16
219       30.14  3.09  Female    Yes   Sat  Dinner     4        30.14
80          NaN  3.00    Male    Yes  Thur   Lunch     2         9.55

# df = sns.load_dataset("tips")

In [174]:
df = sns.load_dataset("tips")

In [175]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [176]:
df['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [185]:
pd.read_csv('../data/gapminder.tsv', sep='\t').groupby('year').mean().index

C:\Users\starl\AppData\Local\Temp\ipykernel_2152\196167932.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  pd.read_csv('../data/gapminder.tsv', sep='\t').groupby('year').mean().index

Int64Index([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
            2007],
           dtype='int64', name='year')

In [186]:
df.groupby('size').filter(lambda x : x['size'].count() >= 30)['size'].value_counts()

2    156
3     38
4     37
Name: size, dtype: int64

In [187]:
df = sns.load_dataset("tips").sample(10, random_state = 42)

In [188]:
df

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [190]:
df.groupby('sex').groups

{'Male': [24, 6, 153, 211, 176, 192, 9], 'Female': [198, 124, 101]}

In [193]:
grouped = df.groupby('sex')

In [194]:
grouped.mean().index

C:\Users\starl\AppData\Local\Temp\ipykernel_2152\1921085888.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean().index

CategoricalIndex(['Male', 'Female'], categories=['Male', 'Female'], ordered=False, dtype='category', name='sex')

In [195]:
grouped.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_2152\2755795945.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean()

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [196]:
grouped.get_group('Female')

     total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [197]:
for i in grouped:
    print(i)

('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)

In [198]:
for i in grouped:
    print(f"그룹 오브젝트의 타입 : {type(i)}")
    print(f"그룹 오브젝트의 길이 : {len(i)}")
    print(f"그룹 오브젝트의 이름 : {i[0]}")

그룹 오브젝트의 타입 : <class 'tuple'>
그룹 오브젝트의 길이 : 2
그룹 오브젝트의 이름 : Male
그룹 오브젝트의 타입 : <class 'tuple'>
그룹 오브젝트의 길이 : 2
그룹 오브젝트의 이름 : Female

In [199]:
df.groupby(['sex','time']).mean().index

C:\Users\starl\AppData\Local\Temp\ipykernel_2152\3167386569.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time']).mean().index

MultiIndex([(  'Male',  'Lunch'),
            (  'Male', 'Dinner'),
            ('Female',  'Lunch'),
            ('Female', 'Dinner')],
           names=['sex', 'time'])

In [200]:
df.groupby(['sex','time']).mean().reset_index()

C:\Users\starl\AppData\Local\Temp\ipykernel_2152\3801897620.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time']).mean().reset_index()

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [201]:
df.groupby(['sex','time'], as_index=False).mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_2152\54886949.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time'], as_index=False).mean()

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [202]:
import datetime

In [203]:
print(datetime.datetime.now())

2023-12-16 19:37:39.331455

In [204]:
print(datetime.datetime.today())

2023-12-16 19:37:52.921136

In [205]:
a = datetime.datetime(1970, 1,1 )
b = datetime.datetime(2023, 12, 19, 6, 14)

In [206]:
a

datetime.datetime(1970, 1, 1, 0, 0)

In [207]:
print(a)
print(b)

1970-01-01 00:00:00
2023-12-19 06:14:00

In [208]:
print(a-b)

-19711 days, 17:46:00

In [209]:
print(type(a-b))

<class 'datetime.timedelta'>

In [211]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=[0])

In [212]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [213]:
df = pd.read_csv('../data/country_timeseries.csv')

In [214]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,3/27/2014,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,3/26/2014,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,3/25/2014,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,3/24/2014,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,3/22/2014,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [215]:
df['Date'] = pd.to_datetime(df['Date'])

In [216]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: datetime64[ns](1), float64(16), int64(1)
memory usage: 17.3 KB

In [217]:
data = pd.DataFrame({
    'data' : ['01/01/15', '02/01/15', '03/01/15']
})

In [218]:
data

       data
0  01/01/15
1  02/01/15
2  03/01/15

In [219]:
df = data

In [220]:
df['date2'] = pd.to_datetime(df['data'], format='%d/%m/%y')
df['date3'] = pd.to_datetime(df['data'], format='%m/%d/%y')
df['date4'] = pd.to_datetime(df['data'], format='%y/%m/%d')

In [221]:
df

       data      date2      date3      date4
0  01/01/15 2015-01-01 2015-01-01 2001-01-15
1  02/01/15 2015-01-02 2015-02-01 2002-01-15
2  03/01/15 2015-01-03 2015-03-01 2003-01-15

In [223]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      object
 1   date2   3 non-null      datetime64[ns]
 2   date3   3 non-null      datetime64[ns]
 3   date4   3 non-null      datetime64[ns]
dtypes: datetime64[ns](3), object(1)
memory usage: 228.0+ bytes